Revit 2026 API

# ParameterAsValueString Method

---

Get the parameter value as a string with units.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string AsValueString()
```
```vb
Public Function AsValueString As String
```
```cpp
public:
String^ AsValueString()
```
```fsharp
member AsValueString : unit -> string
```

#### Return Value

StringThe string that represents the parameter value.

#### Reference

Parameter Class

AsValueString Overload

Autodesk.Revit.DB Namespace